### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [250]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [251]:
player_count = len(purchase_data["SN"].unique()) 
purchase_data["Total Players"] = player_count
purchase_data.columns
player_count_df = pd.DataFrame({"Total Players": [player_count]})
player_count_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [252]:
# Number of unique items
unique_items = len(purchase_data["Item ID"].unique())
unique_items

179

In [253]:
# Average purchase price
average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [254]:
# Total number of purchases
num_purchases = purchase_data["Purchase ID"].count()
num_purchases

780

In [255]:
# Total Revenue
total_rev = purchase_data["Price"].sum()
total_rev

2379.77

In [256]:
# Purchasing Analysis (Total) 
summary_df = pd.DataFrame({"Number of unique items": [unique_items], 
                           "Average Price": average_price, 
                           "Number of Purchases": num_purchases, 
                           "Total Revenue": total_rev})
summary_df

   Number of unique items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [257]:
# Formatting 
summary_df["Average Price"] = summary_df["Average Price"].map("${:.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:,.2f}".format)
summary_df

   Number of unique items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [258]:
# Group by gender
group_gen = purchase_data.groupby(["Gender"])

In [259]:
# Count total unique people 
total_people = len(purchase_data["SN"].unique())
total_people

576

In [260]:
# Count gender
count_gen = group_gen.nunique()["SN"]
count_gen

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [261]:
# Percentage by gender 
percentages_gen = (count_gen / total_people)*100
percentages_gen

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [262]:
# Create dataframe with gender count and percentages 
gender_dem_df = pd.DataFrame ({"Total Count":count_gen, "Percentage of Players": percentages_gen})
gender_dem_df

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [263]:
# Formatting
gender_dem_df["Percentage of Players"] = gender_dem_df["Percentage of Players"].map("{:.2f}%".format)
gender_dem_df

                       Total Count Percentage of Players
Gender
Female                          81                14.06%
Male                           484                84.03%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [264]:
# Purchase count by gender
purchase_count_gen = group_gen["Purchase ID"].count()
purchase_count_gen

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [265]:
# Average purchase price by gender 
avg_purch_price_gen = group_gen["Price"].mean()
avg_purch_price_gen

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [266]:
# Total purchase value by gender INCLUDE DOLLAR SIGN
total_purchase_value_gen = group_gen["Price"].sum()
total_purchase_value_gen

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [267]:
# Average total purchase per person by gender 
average_total_purchase_pp_pg = (total_purchase_value_gen / count_gen)
average_total_purchase_pp_pg

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [268]:
# Create a new dataframe to hold the results 
summary_df_gen = pd.DataFrame({"Purchase count": purchase_count_gen,
                              "Average purchase price": avg_purch_price_gen,
                           "Total purchase value": total_purchase_value_gen, 
                           "Average Purchase Total per Person": average_total_purchase_pp_pg
                              })

# Set index
#summary_df.set_index("Gender", inplace = True)

summary_df_gen

,Purchase count,Average purchase price,Total purchase value,Average Purchase Total per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [269]:
# Formatting

summary_df_gen ["Purchase count"] = summary_df_gen["Purchase count"].map("${:,.2f}".format)
summary_df_gen ["Average purchase price"] = summary_df_gen["Average purchase price"].map("${:,.2f}".format)
summary_df_gen ["Total purchase value"] = summary_df_gen["Total purchase value"].map("${:,.2f}".format)
summary_df_gen ["Average Purchase Total per Person"] = summary_df_gen["Average Purchase Total per Person"].map("${:,.2f}".format)
summary_df_gen = summary_df_gen.loc[:,["Purchase count", "Average purchase price","Total purchase value", "Average Purchase Total per Person"]]

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [270]:
# Create bins and bin names, bins are 0, 10, 20, 30, 40, 50
bins = [0, 9.99, 14.99, 19.99, 24.99, 29.99, 34.99, 39.99, 100]
bin_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
purchase_data["Age group"] = pd.cut(purchase_data["Age"], bins, labels=bin_names, include_lowest=True)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players,Age group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,576,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,576,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,576,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,576,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,576,20-24

In [271]:
# Group by age group
group_age = purchase_data.groupby(["Age group"])

In [272]:
# Total unique purchases by age group
total_count_age = group_age.nunique()["SN"]
total_count_age

Age group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [273]:
# Percentages 
percentages_age = (total_count_age / total_people)*100
percentages_age

Age group
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [274]:
# Dataframe
# Create dataframe with gender count and percentages 
age_df = pd.DataFrame ({"Total Count":total_count_age, "Percentage of Players": percentages_age})
age_df

           Total Count  Percentage of Players
Age group
<10                 17               2.951389
10-14               22               3.819444
15-19              107              18.576389
20-24              258              44.791667
25-29               77              13.368056
30-34               52               9.027778
35-39               31               5.381944
40+                 12               2.083333

In [275]:
# Formatting
age_df["Percentage of Players"] = age_df["Percentage of Players"].map("{:.2f}%".format)
age_df

           Total Count Percentage of Players
Age group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [276]:
# Create bins and bin names, bins are 0, 10, 20, 30, 40, 50
bins = [0, 10, 15, 20, 25, 30, 35, 40, 50]
bin_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
purchase_data["Age group"] = pd.cut(purchase_data["Age"], bins, labels=bin_names, include_lowest=True)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players,Age group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,576,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,576,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,576,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,576,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,576,20-24

In [277]:
# Purchase count by age group
purchase_count_age = group_age["Purchase ID"].count()
purchase_count_age

Age group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [278]:
# Average purchase price by age group 
price_average_age = group_age["Price"].mean()
price_average_age

Age group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [279]:
# Total purchase value by age group 
total_purchase_value_age = group_age["Price"].sum()
total_purchase_value_age

Age group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [280]:
# Average total purchase per person by age group 
average_total_purchase_pp_pa = (total_purchase_value_age / total_count_age)
average_total_purchase_pp_pa

Age group
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [281]:
# Create dataframe and print 
summary_df_age = pd.DataFrame({"Purchase count": purchase_count_age,
                              "Average purchase price": price_average_age,
                           "Total purchase value": total_purchase_value_age, 
                               "Average Purchase Total per Person by Age Group": average_total_purchase_pp_pa
                              })

# Set index
summary_df_age.set_index = "Age group"

summary_df_age

,Purchase count,Average purchase price,Total purchase value,Average Purchase Total per Person by Age Group
Age group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [282]:
# Formatting
summary_df_age ["Average purchase price"] = summary_df_age["Average purchase price"].map("${:,.2f}".format)
summary_df_age ["Purchase count"] = summary_df_age["Purchase count"].map("{:,}".format)
summary_df_age ["Total purchase value"] = summary_df_age["Total purchase value"].map("${:,.2f}".format)
summary_df_age ["Average Purchase Total per Person by Age Group"] = summary_df_age["Average Purchase Total per Person by Age Group"].map("${:,.2f}".format)
summary_df_age = summary_df_age.loc[:,["Purchase count", "Average purchase price","Total purchase value", "Average Purchase Total per Person by Age Group"]]
summary_df_age

,Purchase count,Average purchase price,Total purchase value,Average Purchase Total per Person by Age Group
Age group,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [283]:
# Identify the the top 5 spenders in the game by total purchase value 
# Group by player
group = purchase_data.groupby(["SN"])

In [284]:
# Purchase count
purchase_count_group = group["Purchase ID"].count()
purchase_count_group

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [285]:
# Average Purchase Value
avg_purchase_value_group = group["Price"].mean()
avg_purchase_value_group

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [286]:
# Total Purchase Value
total_purchase_value_group = group["Price"].sum()
total_purchase_value_group

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [287]:
# Create DF 
top_spend_df = pd.DataFrame({
    "Purchase count": purchase_count_group, 
    "Average Purchase Price": avg_purchase_value_group, 
    "Total Purchase Value": total_purchase_value_group
                            })

top_spend_df

               Purchase count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [288]:
# Sort by total purchase value high to low 
top_spend_sorted = top_spend_df.sort_values("Total Purchase Value", ascending=False)
top_spend_sorted.head()

             Purchase count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [289]:
# Formatting
top_spend_sorted["Average Purchase Price"] = top_spend_sorted["Average Purchase Price"].map("${:,.2f}".format)
top_spend_sorted["Total Purchase Value"] = top_spend_sorted["Total Purchase Value"].map("${:,.2f}".format)
top_spend_sorted.head()

             Purchase count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [290]:
# Retrieve the Item ID, Item Name, and Item Price columns
items = purchase_data[["Item ID", "Item Name", "Price"]]
items

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [291]:
# Group by Item ID and Item Name
items_group = items.groupby(["Item ID", "Item Name"])
items_group

In [292]:
# Purchase count
purchase_count_pop = items_group["Item ID"].count()
purchase_count_pop

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Item ID, Length: 179, dtype: int64

In [293]:
# Item price
item_price_pop = total_purchase_value_pop/purchase_count_pop
item_price_pop

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Length: 179, dtype: float64

In [294]:
# Total purchase value
total_purchase_value_pop = items_group["Price"].sum()
total_purchase_value_pop

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [295]:
# Dataframe 
most_pop_df = pd.DataFrame({
    "Purchase count": purchase_count_pop, 
    "Item Price": item_price_pop, 
    "Total Purchase Value": total_purchase_value_pop
})   

most_pop_df

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [296]:
# Sort by purchase count in descending order
most_pop_df_sorted_count = most_pop_df.sort_values(["Purchase count"], ascending=False)
most_pop_df_sorted_count.head()

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [297]:
# Formatting currency 
most_pop_df_sorted_count["Item Price"] = most_pop_df_sorted_count["Item Price"].map("${:,.2f}".format)
most_pop_df_sorted_count["Total Purchase Value"] = most_pop_df_sorted_count["Total Purchase Value"].map("${:,.2f}".format)
most_pop_df_sorted_count.head()

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [298]:
# DF
most_prof_df = most_pop_df
most_prof_df

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [299]:
# Sort by total purchase value in descending order
most_prof_df_sorted_total = most_prof_df.sort_values(["Total Purchase Value"], ascending=False)
most_prof_df_sorted_total.head()

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [300]:
# Formatting
most_prof_df_sorted_total["Item Price"] = most_prof_df_sorted_total["Item Price"].map("${:,.2f}".format)
most_prof_df_sorted_total["Total Purchase Value"] = most_prof_df_sorted_total["Total Purchase Value"].map("${:,.2f}".format)
most_prof_df_sorted_total.head()

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80

In [301]:
# Three observable trends based on the data
# Trend 1: The majority of the players are male (84%), and female players spend more per purchase on average than male players ($4.46 vs $4.06).
# Trend 2: Most players are in the age group 20-24 years old (44.8%). People in the <10 age group and 35-39 age group spend more than players in the 20-24 age group, but they only account for a small part of the total players(2.95% and 5.38% respectively).
# Trend 3: Final Critic was the most popular and most profitable game.